Горничная/src/Documents/Уборка/Уборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Уборка</name>
  <basedOn>Document.ЗаданияНаУборку</basedOn>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаУборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоДо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоПосле</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаУборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияУборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Геопозиция</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Горничная/src/Documents/Уборка/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки) Тогда
		Объект.ВремяНачалаУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Остановить уборку";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(233, 150, 122);
	ИначеЕсли ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки)  Тогда
		Объект.ВремяОкончанияУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Уборка окончена";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(60, 179, 113);
		Элементы.НачатьУборку.Доступность = Ложь;
	КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПолучитьГеопозицию(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
	Провайдеры  = СредстваГеопозиционирования.ПолучитьПровайдеров();
	Для Каждого Провайдер Из Провайдеры Цикл
		Если НЕ Провайдер.Платный и Провайдер.Доступен И провайдер.ИспользуетСпутники Тогда
			ИскомыйПровайдер = Провайдер;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИскомыйПровайдер = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "ru = 'Требуемый провайдер не обнаружен'";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИскомыйПровайдер.Имя);
	Адрес = ПолучитьАдресПоМестоположению(ДанныеМестоположения.Координаты);

	Объект.Геопозиция = СтрШаблон("%1, %2 %3", Адрес.Город, Адрес.Улица, Адрес.Дом);
	
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьУборку(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки) Тогда
		Объект.ВремяНачалаУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Остановить уборку";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(233, 150, 122);
	ИначеЕсли ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки)  Тогда
		Объект.ВремяОкончанияУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Уборка окончена";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(60, 179, 113);
		Элементы.НачатьУборку.Доступность = Ложь;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Звонок(Команда)
	#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда	
		СредстваТелефонии.НабратьНомер(Объект.ТелефонКлиента, Ложь);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
